Sametatak/machine/STM32/PROJECT_TARIM_ROBOTU/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOSFET_2_B_H_Pin GPIO_PIN_0
#define MOSFET_2_B_H_GPIO_Port GPIOC
#define MOSFET_2_A_H_Pin GPIO_PIN_1
#define MOSFET_2_A_H_GPIO_Port GPIOC
#define MOSFET_1_B_H_Pin GPIO_PIN_2
#define MOSFET_1_B_H_GPIO_Port GPIOC
#define MOSFET_1_A_H_Pin GPIO_PIN_3
#define MOSFET_1_A_H_GPIO_Port GPIOC
#define JOYSTICK_BTN_Pin GPIO_PIN_2
#define JOYSTICK_BTN_GPIO_Port GPIOB
#define MOSFET_4_B_H_Pin GPIO_PIN_12
#define MOSFET_4_B_H_GPIO_Port GPIOB
#define MOSFET_4_A_H_Pin GPIO_PIN_13
#define MOSFET_4_A_H_GPIO_Port GPIOB
#define MOSFET_3_B_H_Pin GPIO_PIN_14
#define MOSFET_3_B_H_GPIO_Port GPIOB
#define MOSFET_3_A_H_Pin GPIO_PIN_15
#define MOSFET_3_A_H_GPIO_Port GPIOB
#define BUZZER_Pin GPIO_PIN_9
#define BUZZER_GPIO_Port GPIOC
#define SONAR_DATA_Pin GPIO_PIN_4
#define SONAR_DATA_GPIO_Port GPIOB
#define FREN_Pin GPIO_PIN_5
#define FREN_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
